Revit 2027 API
PaperSourceSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual PaperSourceSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As PaperSourceSetIterator
public:
virtual PaperSourceSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> PaperSourceSetIterator
override ForwardIterator : unit -> PaperSourceSetIterator
Return Value
PaperSourceSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
PaperSourceSet Class
Autodesk.Revit.DB Namespace